Repository: cross-solution/YawikCompanyRegistration
Catalog: language/*.po
Languages: el_gr, fr_be, nl_be, ro

source: Register
el_gr: Μητρώο
fr_be: Enregistrement
nl_be: Registreer
ro: Inregistreaza-te

source: I'm not yet a customer
el_gr: Δεν είμαι ακόμα ένας πελάτης
fr_be: Je ne suis pas encore un client
nl_be: Ik ben nog geen klant
ro: Nu sunt încă un client

source: I am already a customer
el_gr: Είμαι ήδη πελάτης
fr_be: Je suis déjà un client
nl_be: Ik ben al klant
ro: Sunt deja un client

source: I forgot my password
el_gr: Ξέχασα τον κωδικό μου
fr_be: J'ai oublié mon mot de passe
nl_be: Ik ben mijn wachtwoord vergeten
ro: Am uitat parola

source: The registration has been successful
el_gr: Η εγγραφή ήταν επιτυχής
fr_be: L'enregistrement a été effectué avec succès
nl_be: De registratie is succesvol geweest
ro: Înregistrarea a avut succes

source: An Email with an activation link has been sent, please try to check your email box
el_gr: Ένα μήνυμα με ένα σύνδεσμο ενεργοποίησης έχει σταλεί, δοκιμάστε να ελέγξετε κιβώτιο ηλεκτρονικού ταχυδρομείου σας
fr_be: Un email avec un lien d'activation a été envoyé, veuillez vérifier votre boîte mail.
nl_be: Een e-mail met een activatie link is verzonden, dan kunt u proberen om uw e-mail box controleren
ro: Un e-mail cu un link de activare a fost trimis, vă rugăm să încercați să verificați caseta de e-mail

source: Salutation
nl_be: Begroeting
ro: Salut

source: please select
fr_be: Veuillez sélectionner
nl_be: Selecteer alstublieft
ro: te rog selecteaza

source: Mr.
fr_be: M.
ro: Dl.

source: Mrs.
fr_be: Mme.
nl_be: Mevr.
ro: Doamna.

source: Name
el_gr: Όνομα
fr_be: Nom
nl_be: Naam
ro: Nume

source: User can not be created
el_gr: Ο χρήστης δεν μπορεί να δημιουργηθεί
fr_be: L'utilisateur ne peut pas être crée
nl_be: De gebruiker kan niet worden gemaakt
ro: Utilizatorul nu poate fi creat

source: user with this e-mail address already exists
el_gr: χρήστης με αυτήν τη διεύθυνση ηλεκτρονικού ταχυδρομείου υπάρχει ήδη
fr_be: un utilisateur avec cette adresse mail existe déjà
nl_be: gebruiker met dit e-mailadres bestaat reeds
ro: utilizator cu această adresă de e-mail există deja

source: Please fill form correctly
el_gr: Παρακαλώ συμπληρώστε σωστά φόρμα
fr_be: Veuillez remplir le formulaire correctement
nl_be: Gelieve correct in te vullen formulier
ro: Vă rugăm să completați formularul corect
